[
    {
        "title": "پروژه اپلیکیشن رسمی سرور ماینکرفت ایران استارت خورد.",
        "content": "🔥 با هدف ارائه بهترین خدمات در زمینه سرورهای ماینکرفتی و برای فراهم آوردن لحظات خوش برای پلیرهای عزیز، سرور ماینکرفت ایران به عنوان برترین سرور ماینکرفتی با ویژگی‌های اختصاصی به پیشروی ادامه می‌دهد.

                    ❓ در این بین، استارت پروژه اپلیکیشن اختصاصی بدراک ادیشن برای اولین بار در بین سرور های ماینکرفتی زده شده است؛ آخرین آمارها حاکی از این است که تا به حال هیچ سرور ایرانی و یا خارجی در بدراک ادیشن و حتی در جاوا ادیشن با مسئله داشتن اپلیکیشن اختصاصی روبرو نشده اند. اما، چرا سرور ماینکرفت ایران دارای این اپلیکیشن است؟

                    💬 جواب ساده است. برای سرورهای خارجی، نداشتن اپلیکیشن اختصاصی ضروری نیست. امّا در برخی موارد و برای سرورهای ایرانی، این امر به دلیل داشتن مشکلات فیلترینگ، اهمیت ویژه‌ای پیدا می‌کند که در ادامه چند مورد از آن ها را برسی میکنیم...

                    1⃣ همانطور که میدانیم، شبکه‌های اجتماعی در ایران فیلتر شده‌اند و خرید و فروش فیلترشکن‌ها غیرقانونی محسوب می‌شود. بسیاری از کاربران به جای استفاده از VPN‌ های قانونی و کاربردی، از وی‌پی‌ان‌های که اطلاعات کاربران را می‌دزدند و با فروش این اطلاعات درآمد کسب می‌کردند، استفاده می‌کنند درنتیجه امنیت سایبری افراد به صورت جدی در معرض خطر قرار میگرفت.

                    2⃣ برخی از کاربران برای تهیه اشتراک ماهیانه برخی از VPN‌ ها، هزینه‌های بسیار بالایی به برخی افراد سودجو پرداخت می‌کنند و در صورت عدم انجام این کار دسترسی کاربران به فضای مجازی به دلیل داشتن مشکل فیلترینگ بصورت کامل قطع می‌شود و در نتیجه دسترسی بازیکن با کانال اطلاع رسانی سرور ماینکرفتی قطع میشود.

                    3⃣ به دلایل ذکر شده در بالا، برخی از پلیرهای ماینکرفت ایرانی مجبور به نصب و استفاده از پیام رسان های متنوع داخلی میکردند که ما با این موضوع هیچ تقابلی نداریم، اما مشکلاتی ازجمله مدیریت مشکل چندین و چند کانال (به علت وجود پیامرسان های داخلی متفاوت) برای ما به وجود میاورد که ما برای رفع این مشکل تصمیم به ساخت بخش اخبار برای این برنامه گرفتیم

                    این مشکل برای پلیرهای سرور ماینکرفت ایرانی خصوصاً مهم است چرا که اکثر سرورها ایرانی در تلگرام فعالیت دارند و بعد از فیلترینگ شبکه های اجتماعی با تمامی مشکلات نام برده شده روبرو خواهند شد...

                    برای رفع این مشکل، سرور ماینکرفت ایران، این پروژه اپلیکیشن اختصاصی را آغاز کرده است؛ ازین پس به بعد تمامی پلیر های سرور ماینکرفت ایران از طریق همین برنامه به آخرین اطلاعیه‌های مربوط به سرور با حداقل فشار های مربوط به فیلترینگ دسترسی خواهند داشت.",
        "tag": "رویداد",
        "writer": "EzDevelop",
        "img": "https://th.bing.com/th/id/OIG.9RHpTCevS.3sJ6Da9B7_?w=270&h=270&c=6&r=0&o=5&pid=ImgGn",
        "date": "16 شهریور 1402",
        "time_stamp": 1694032594,
        "id": 4342
    },
{
        "title": "ممنگتود.",
        "content": "🔥 با هدف ارائه بهترین خدمات در زمینه سرورهای ماینکرفتی و برای فراهم آوردن لحظات خوش برای پلیرهای عزیز، سرور ماینکرفت ایران به عنوان برترین سرور ماینکرفتی با ویژگی‌های اختصاصی به پیشروی ادامه می‌دهد.

                    ❓ در این بین، استارت پروژه اپلیکیشن اختصاصی بدراک ادیشن برای اولین بار در بین سرور های ماینکرفتی زده شده است؛ آخرین آمارها حاکی از این است که تا به حال هیچ سرور ایرانی و یا خارجی در بدراک ادیشن و حتی در جاوا ادیشن با مسئله داشتن اپلیکیشن اختصاصی روبرو نشده اند. اما، چرا سرور ماینکرفت ایران دارای این اپلیکیشن است؟

                    💬 جواب ساده است. برای سرورهای خارجی، نداشتن اپلیکیشن اختصاصی ضروری نیست. امّا در برخی موارد و برای سرورهای ایرانی، این امر به دلیل داشتن مشکلات فیلترینگ، اهمیت ویژه‌ای پیدا می‌کند که در ادامه چند مورد از آن ها را برسی میکنیم...

                    1⃣ همانطور که میدانیم، شبکه‌های اجتماعی در ایران فیلتر شده‌اند و خرید و فروش فیلترشکن‌ها غیرقانونی محسوب می‌شود. بسیاری از کاربران به جای استفاده از VPN‌ های قانونی و کاربردی، از وی‌پی‌ان‌های که اطلاعات کاربران را می‌دزدند و با فروش این اطلاعات درآمد کسب می‌کردند، استفاده می‌کنند درنتیجه امنیت سایبری افراد به صورت جدی در معرض خطر قرار میگرفت.

                    2⃣ برخی از کاربران برای تهیه اشتراک ماهیانه برخی از VPN‌ ها، هزینه‌های بسیار بالایی به برخی افراد سودجو پرداخت می‌کنند و در صورت عدم انجام این کار دسترسی کاربران به فضای مجازی به دلیل داشتن مشکل فیلترینگ بصورت کامل قطع می‌شود و در نتیجه دسترسی بازیکن با کانال اطلاع رسانی سرور ماینکرفتی قطع میشود.

                    3⃣ به دلایل ذکر شده در بالا، برخی از پلیرهای ماینکرفت ایرانی مجبور به نصب و استفاده از پیام رسان های متنوع داخلی میکردند که ما با این موضوع هیچ تقابلی نداریم، اما مشکلاتی ازجمله مدیریت مشکل چندین و چند کانال (به علت وجود پیامرسان های داخلی متفاوت) برای ما به وجود میاورد که ما برای رفع این مشکل تصمیم به ساخت بخش اخبار برای این برنامه گرفتیم

                    این مشکل برای پلیرهای سرور ماینکرفت ایرانی خصوصاً مهم است چرا که اکثر سرورها ایرانی در تلگرام فعالیت دارند و بعد از فیلترینگ شبکه های اجتماعی با تمامی مشکلات نام برده شده روبرو خواهند شد...

                    برای رفع این مشکل، سرور ماینکرفت ایران، این پروژه اپلیکیشن اختصاصی را آغاز کرده است؛ ازین پس به بعد تمامی پلیر های سرور ماینکرفت ایران از طریق همین برنامه به آخرین اطلاعیه‌های مربوط به سرور با حداقل فشار های مربوط به فیلترینگ دسترسی خواهند داشت.",
        "tag": "رویداد",
        "writer": "EzDevelop",
        "img": "https://th.bing.com/th/id/OIG.9RHpTCevS.3sJ6Da9B7_?w=270&h=270&c=6&r=0&o=5&pid=ImgGn",
        "date": "16 شهریور 1402",
        "time_stamp": 1694032594,
        "id": 43455
    },
    {
        "title": "here is title",
        "content": "Here is content",
        "tag": "Smth",
        "writer": "Smth",
        "img": "Smth",
        "date": "d",
        "time_stamp": 1694032594,
        "id": 3
    },
 {
            "title": "ممنک ارش",
            "content": "ممنگ ارش رو تپلیدم",
            "tag": "اعلان",
            "writer": "Smth",
            "img": "https://cdn.manzoom.ir/media/person_images/d6ahVx0bWMSoJhhS4C-5x2Rjt54QKXx5GBCAThgQgE4.jpg.215x307_q100_box-69%2C0%2C1737%2C2382_crop_detail.jpg",
            "date": "فاحشه خانه",
            "time_stamp": 293483948,
            "id": 42
        }
    /*
        {
            "title": "Smth",
            "content": "Smth",
            "tag": "Smth",
            "writer": "Smth",
            "img": "Smth",
            "date": "d",
            "time_stamp": 293483948,
            "id": 4342
        }
    */
]
